/********************************
//运放初始化模式参考程序
程序在上电复位的时候会自动初始化运放调节位

***************************************/
#include <sc.h>           		//调用单片机的头文件

void Init_System();

volatile unsigned char rec_eedat,rec_eedatbak;
	
void main(void)            		//主函数,单片机开机后就是从这个函数开始运行
{
	
	Init_System();
	
	/********************************/
	OPACOFM = 0;			//OPA0工作于正常模式
							//不操作OPAXADJ，默认使用
							
							
	/********************************************************************
		Bit7  OPA_EN:  OPA使能位
			1=  使能OPA
			0=  关闭OPA
		Bit6  OPA_OEN:  OPA输出使能
			1=  OPA输出接至I/O口(OPA_O管脚)
			0=  OPA输出不接至I/O口
		Bit5  未用 
		Bit4  OPA_ADC:  ADC通道使能
			1=  OPA的输出接至ADC30通道
			0=  OPA的输出不接至ADC30通道
		Bit3~Bit1  未用 
		Bit0  OPA_FT:  运放输出内部滤波选择
			1=  OPA输出内部接滤波电路
			0=  OPA输出内部不接滤波电路
	**************************************************************************/
	OPACON = 0B11010001;	//OPA0使能，，输出接到IO和AN30，接内部滤波
	
    while(1)					//死循环,单片机初始化后,将一直运行这个死循环
    {
			asm("clrwdt");
			EECON1 = 0;
    }
}


/***********************************************
函数名称：Init_System
函数功能：系统初始化
入口参数：无
出口参数：无
备注：
************************************************/
void Init_System()
{
	asm("nop");
	asm("clrwdt");
	INTCON = 0;					//系统初始化
	OSCCON = 0X72;				//配置振荡为8M,开WDT
	OPTION_REG = 0;
	
	TRISA = 0B00111111;			//初始化IO状态，做运放则该口线需做输入
	TRISB = 0B00000000;

	PORTA = 0B00000000;
	PORTB = 0B00000000;			//初始化输出

}